# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license
# python -m torch.distributed.run --nproc_per_node 2 --master_port 1 train.py --data coco128.yaml --weights yolov5s.pt --img 640 --device 0,1,2,3
# Parameters
nc: 1  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [4,5, 8,10, 22,18] # P2/4
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
   [-1, 3, C3ResAtnMHSA, [1024, 16, True]],  # 10
  ]

# YOLOv5 v6.0 head
head:
   # FPN
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # P4/16
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],
   [-1, 3, C3ResAtnMHSA, [512, 32, True]],  # 14

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # P3/8
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],
   [-1, 3, C3ResAtnMHSA, [256, 64, True]],  # 18 (P3/8-small)

   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # P2/4
   [[-1, 2], 1, Concat, [1]],
   [-1, 3, C3, [128, False]],  # 22-----------

   # APN
   [-1, 1, Conv, [128, 3, 2]],  # P3/8
   [[-1, 18], 1, Concat, [1]],
   [-1, 3, C3ResAtnMHSA, [256, 64, True]],  # 25-----------

   [-1, 1, Conv, [256, 3, 2]],  # P4/16
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3ResAtnMHSA, [512, 32, True]],  # 28 (P4/16-medium)

   [[22, 25, 28], 1, Detect, [nc, anchors]],  # Detect(P2, P3, P4, P5)
  ]
